tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/energySourceProperties
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      energySourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    source1
    {
        active          true;
        timeStart       0.15;
        duration        0.20;
        selectionMode   cellSet;
        volumeMode      absolute;
        fieldData       5000;
        cellSet         ignitionCells;
    }
);

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
